RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_sdp_regs.h
/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SDP_H
#define HPM_SDP_H

typedef struct {
    __RW uint32_t SDPCR;                       /* 0x0: SDP control register */
    __RW uint32_t MODCTRL;                     /* 0x4: Mod control register. */
    __RW uint32_t PKTCNT;                      /* 0x8: packet counter registers. */
    __RW uint32_t STA;                         /* 0xC: Status Registers */
    __RW uint32_t KEYADDR;                     /* 0x10: Key Address */
    __RW uint32_t KEYDAT;                      /* 0x14: Key Data */
    __RW uint32_t CIPHIV[4];                   /* 0x18 - 0x24: Cipher Initializtion Vector 0 */
    __RW uint32_t HASWRD[8];                   /* 0x28 - 0x44: Hash Data Word 0 */
    __RW uint32_t CMDPTR;                      /* 0x48: Command Pointer */
    __RW uint32_t NPKTPTR;                     /* 0x4C: Next Packet Address Pointer */
    __RW uint32_t PKTCTL;                      /* 0x50: Packet Control Registers */
    __RW uint32_t PKTSRC;                      /* 0x54: Packet Memory Source Address */
    __RW uint32_t PKTDST;                      /* 0x58: Packet Memory Destination Address */
    __RW uint32_t PKTBUF;                      /* 0x5C: Packet buffer size. */
} SDP_Type;


/* Bitfield definition for register: SDPCR */
/*
 * SFTRST (RW)
 *
 * soft reset.
 * Write 1 then 0, to reset the SDP block.
 */
#define SDP_SDPCR_SFTRST_MASK (0x80000000UL)
#define SDP_SDPCR_SFTRST_SHIFT (31U)
#define SDP_SDPCR_SFTRST_SET(x) (((uint32_t)(x) << SDP_SDPCR_SFTRST_SHIFT) & SDP_SDPCR_SFTRST_MASK)
#define SDP_SDPCR_SFTRST_GET(x) (((uint32_t)(x) & SDP_SDPCR_SFTRST_MASK) >> SDP_SDPCR_SFTRST_SHIFT)

/*
 * CLKGAT (RW)
 *
 * Clock Gate for the SDP main logic.
 * Write to 1 will clock gate for most logic of the SDP block, dynamic power saving when not use SDP block.
 */
#define SDP_SDPCR_CLKGAT_MASK (0x40000000UL)
#define SDP_SDPCR_CLKGAT_SHIFT (30U)
#define SDP_SDPCR_CLKGAT_SET(x) (((uint32_t)(x) << SDP_SDPCR_CLKGAT_SHIFT) & SDP_SDPCR_CLKGAT_MASK)
#define SDP_SDPCR_CLKGAT_GET(x) (((uint32_t)(x) & SDP_SDPCR_CLKGAT_MASK) >> SDP_SDPCR_CLKGAT_SHIFT)

/*
 * CIPDIS (RO)
 *
 * Cipher Disable, read the info, whether the CIPHER features is besing disable in this chip or not.
 * 1, Cipher is disabled in this chip.
 * 0, Cipher is enabled in this chip.
 */
#define SDP_SDPCR_CIPDIS_MASK (0x20000000UL)
#define SDP_SDPCR_CIPDIS_SHIFT (29U)
#define SDP_SDPCR_CIPDIS_GET(x) (((uint32_t)(x) & SDP_SDPCR_CIPDIS_MASK) >> SDP_SDPCR_CIPDIS_SHIFT)

/*
 * HASDIS (RO)
 *
 * HASH Disable, read the info, whether the HASH features is besing disable in this chip or not.
 * 1, HASH is disabled in this chip.
 * 0, HASH is enabled in this chip.
 */
#define SDP_SDPCR_HASDIS_MASK (0x10000000UL)
#define SDP_SDPCR_HASDIS_SHIFT (28U)
#define SDP_SDPCR_HASDIS_GET(x) (((uint32_t)(x) & SDP_SDPCR_HASDIS_MASK) >> SDP_SDPCR_HASDIS_SHIFT)

/*
 * CIPHEN (RW)
 *
 * Cipher Enablement, controlled by SW.
 * 1, Cipher is Enabled.
 * 0, Cipher is Disabled.
 */
#define SDP_SDPCR_CIPHEN_MASK (0x800000UL)
#define SDP_SDPCR_CIPHEN_SHIFT (23U)
#define SDP_SDPCR_CIPHEN_SET(x) (((uint32_t)(x) << SDP_SDPCR_CIPHEN_SHIFT) & SDP_SDPCR_CIPHEN_MASK)
#define SDP_SDPCR_CIPHEN_GET(x) (((uint32_t)(x) & SDP_SDPCR_CIPHEN_MASK) >> SDP_SDPCR_CIPHEN_SHIFT)

/*
 * HASHEN (RW)
 *
 * HASH Enablement, controlled by SW.
 * 1, HASH is Enabled.
 * 0, HASH is Disabled.
 */
#define SDP_SDPCR_HASHEN_MASK (0x400000UL)
#define SDP_SDPCR_HASHEN_SHIFT (22U)
#define SDP_SDPCR_HASHEN_SET(x) (((uint32_t)(x) << SDP_SDPCR_HASHEN_SHIFT) & SDP_SDPCR_HASHEN_MASK)
#define SDP_SDPCR_HASHEN_GET(x) (((uint32_t)(x) & SDP_SDPCR_HASHEN_MASK) >> SDP_SDPCR_HASHEN_SHIFT)

/*
 * MCPEN (RW)
 *
 * Memory Copy Enablement, controlled by SW.
 * 1, Memory copy is Enabled.
 * 0, Memory copy is Disabled.
 */
#define SDP_SDPCR_MCPEN_MASK (0x200000UL)
#define SDP_SDPCR_MCPEN_SHIFT (21U)
#define SDP_SDPCR_MCPEN_SET(x) (((uint32_t)(x) << SDP_SDPCR_MCPEN_SHIFT) & SDP_SDPCR_MCPEN_MASK)
#define SDP_SDPCR_MCPEN_GET(x) (((uint32_t)(x) & SDP_SDPCR_MCPEN_MASK) >> SDP_SDPCR_MCPEN_SHIFT)

/*
 * CONFEN (RW)
 *
 * Constant Fill to memory, controlled by SW.
 * 1, Constant fill is Enabled.
 * 0, Constant fill is Disabled.
 */
#define SDP_SDPCR_CONFEN_MASK (0x100000UL)
#define SDP_SDPCR_CONFEN_SHIFT (20U)
#define SDP_SDPCR_CONFEN_SET(x) (((uint32_t)(x) << SDP_SDPCR_CONFEN_SHIFT) & SDP_SDPCR_CONFEN_MASK)
#define SDP_SDPCR_CONFEN_GET(x) (((uint32_t)(x) & SDP_SDPCR_CONFEN_MASK) >> SDP_SDPCR_CONFEN_SHIFT)

/*
 * DCRPDI (RW)
 *
 * Decryption Disable bit, Write to 1 to disable the decryption.
 */
#define SDP_SDPCR_DCRPDI_MASK (0x80000UL)
#define SDP_SDPCR_DCRPDI_SHIFT (19U)
#define SDP_SDPCR_DCRPDI_SET(x) (((uint32_t)(x) << SDP_SDPCR_DCRPDI_SHIFT) & SDP_SDPCR_DCRPDI_MASK)
#define SDP_SDPCR_DCRPDI_GET(x) (((uint32_t)(x) & SDP_SDPCR_DCRPDI_MASK) >> SDP_SDPCR_DCRPDI_SHIFT)

/*
 * TSTPKT0IRQ (RW)
 *
 * Test purpose for interrupt when Packet counter reachs "0", but CHAIN=1 in the current packet.
 */
#define SDP_SDPCR_TSTPKT0IRQ_MASK (0x20000UL)
#define SDP_SDPCR_TSTPKT0IRQ_SHIFT (17U)
#define SDP_SDPCR_TSTPKT0IRQ_SET(x) (((uint32_t)(x) << SDP_SDPCR_TSTPKT0IRQ_SHIFT) & SDP_SDPCR_TSTPKT0IRQ_MASK)
#define SDP_SDPCR_TSTPKT0IRQ_GET(x) (((uint32_t)(x) & SDP_SDPCR_TSTPKT0IRQ_MASK) >> SDP_SDPCR_TSTPKT0IRQ_SHIFT)

/*
 * RDSCEN (RW)
 *
 * when set to "1", the 1st data packet descriptor loacted in the register(CMDPTR, NPKTPTR, ...)
 * when set to "0", the 1st data packet descriptor loacted in the memeory(pointed by CMDPTR)
 */
#define SDP_SDPCR_RDSCEN_MASK (0x100U)
#define SDP_SDPCR_RDSCEN_SHIFT (8U)
#define SDP_SDPCR_RDSCEN_SET(x) (((uint32_t)(x) << SDP_SDPCR_RDSCEN_SHIFT) & SDP_SDPCR_RDSCEN_MASK)
#define SDP_SDPCR_RDSCEN_GET(x) (((uint32_t)(x) & SDP_SDPCR_RDSCEN_MASK) >> SDP_SDPCR_RDSCEN_SHIFT)

/*
 * INTEN (RW)
 *
 * Interrupt Enablement, controlled by SW.
 * 1, SDP interrupt is enabled.
 * 0, SDP interrupt is disabled.
 */
#define SDP_SDPCR_INTEN_MASK (0x1U)
#define SDP_SDPCR_INTEN_SHIFT (0U)
#define SDP_SDPCR_INTEN_SET(x) (((uint32_t)(x) << SDP_SDPCR_INTEN_SHIFT) & SDP_SDPCR_INTEN_MASK)
#define SDP_SDPCR_INTEN_GET(x) (((uint32_t)(x) & SDP_SDPCR_INTEN_MASK) >> SDP_SDPCR_INTEN_SHIFT)

/* Bitfield definition for register: MODCTRL */
/*
 * AESALG (RW)
 *
 * AES algorithem selection.
 * 0x0 = AES 128;
 * 0x1 = AES 256;
 * 0x8 = SM4；
 * Others, reserved.
 */
#define SDP_MODCTRL_AESALG_MASK (0xF0000000UL)
#define SDP_MODCTRL_AESALG_SHIFT (28U)
#define SDP_MODCTRL_AESALG_SET(x) (((uint32_t)(x) << SDP_MODCTRL_AESALG_SHIFT) & SDP_MODCTRL_AESALG_MASK)
#define SDP_MODCTRL_AESALG_GET(x) (((uint32_t)(x) & SDP_MODCTRL_AESALG_MASK) >> SDP_MODCTRL_AESALG_SHIFT)

